In [2]:
import numpy as np
import pandas as pd

In [3]:
students = {"age":np.random.randint(10, 15, 10), "marks": np.random.randint(0, 30, 10), "height": np.random.randint(100, 200, 10)}
print(students)

{'age': array([11, 14, 13, 13, 13, 13, 10, 12, 14, 11]), 'marks': array([21,  1,  7,  2,  7,  6, 12, 26, 24, 16]), 'height': array([127, 114, 112, 196, 130, 164, 120, 132, 193, 186])}

In [4]:
df = pd.DataFrame(students)
df

   age  marks  height
0   11     21     127
1   14      1     114
2   13      7     112
3   13      2     196
4   13      7     130
5   13      6     164
6   10     12     120
7   12     26     132
8   14     24     193
9   11     16     186

In [5]:
# To obtain an values till specified index from a data frame
df.head(13)

   age  marks  height
0   11     21     127
1   14      1     114
2   13      7     112
3   13      2     196
4   13      7     130
5   13      6     164
6   10     12     120
7   12     26     132
8   14     24     193
9   11     16     186

In [6]:
# To obtain specified number of values from the end 
df.tail(2)

   age  marks  height
8   14     24     193
9   11     16     186

 # Converting a data frame into a CSV(Comma Seperated Values) File

In [10]:
df.to_csv('students.csv')